src/cf/DataProcessors/уатРаспределениеВагоновПоЗаказамНаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>уатРаспределениеВагоновПоЗаказамНаТС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/уатОбеспечениеЗаказовНаТСВагонами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатОбеспечениеЗаказовНаТСВагонами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаТС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГУ12</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрузовыеМеста_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКодыЕТСНГ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вагон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатЭтапыМультимодальныхПеревозок_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатЭтапыМультимодальныхПеревозок_уэ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправленияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>xПунктаНазначения</Name>
					<Comment>Используется для отображения на схеме перевозок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>xПунктаОтправления</Name>
					<Comment>Используется для отображения на схеме перевозок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>yПунктаНазначения</Name>
					<Comment>Используется для отображения на схеме перевозок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>yПунктаОтправления</Name>
					<Comment>Используется для отображения на схеме перевозок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСПеревозчиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФормированияКомплектовДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатНастройкиКомплектовДокументов_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьАктОтгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьАктПриемки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьИзвлечениеГрузовИзКонтейнера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьМаршрутныйЛист</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьРазмещениеГрузовВКонтейнере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейОтНачалаОтправление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейОтНачалаНазначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказГрузоотправителя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатСтатусыГрузов_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСтатусыГрузов_уэ</Name>
			<Comment>Статусы грузов (уэ)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатусы_уэ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрузовыеМеста_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатЕдиницыИзмеренияВеса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатЕдиницыИзмеренияВеса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Килограмм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тонна</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатЕдиницыИзмеренияОбъема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатЕдиницыИзмеренияОбъема</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МетрКубический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Литр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/уатРаспределениеВагоновПоЗаказамНаТС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Организация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
			
	Подразделение = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновноеПодразделениеОрганизации");
		
	ПериодДатаНач = НачалоМесяца(ТекущаяДатаСеанса());
	ПериодДатаКон = КонецМесяца(ТекущаяДатаСеанса());
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Подразделение", Подразделение);
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Станция", Станция);
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("РабочаяДатаНачало", ПериодДатаНач);
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("РабочаяДатаКонец", ПериодДатаКон);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Подразделение", Подразделение);
КонецПроцедуры

&НаКлиенте
Процедура СтанцияПриИзменении(Элемент)
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Станция", Станция);
КонецПроцедуры

&НаКлиенте
Процедура СтанцияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("СтанцияНачалоВыбораЗавершение", ЭтотОбъект);
	ОтборПоТипуПункта = Новый Структура("ТипПункта", ПредопределенноеЗначение("Справочник.уатТипыПунктов.ЖДстанция"));
	ОткрытьФорму("Справочник.уатПунктыНазначения.ФормаВыбора", Новый Структура("Отбор", ОтборПоТипуПункта), ЭтотОбъект,,,,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СтанцияНачалоВыбораЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Станция = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДнейПриИзменении(Элемент)
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("ОтправлениеС", КонецДня(Дата) - (КоличествоДней * 86400) + 1);
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("ДоставкаПо", КонецДня(Дата));
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаНачПриИзменении(Элемент)
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("РабочаяДатаНачало", ПериодДатаНач);
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаКонПриИзменении(Элемент)
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("РабочаяДатаКонец", ПериодДатаКон);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокЗаказов

&НаКлиенте
Процедура СписокЗаказовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокЗаказов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуРаспределенныхВагонов(ТекущиеДанные.ЗаказНаТС, ТекущиеДанные.ТипВагона, ТекущиеДанные.ГрузовоеМесто, ТекущиеДанные.КодГруза);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокЗаказов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(Неопределено, ТекущиеДанные.ЗаказНаТС);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ЗначенияПеретаскивания = Новый Структура;
	ЗначенияПеретаскивания.Вставить("ЗаказНаТС", ПараметрыПеретаскивания.Значение.ЗаказНаТС);
	ЗначенияПеретаскивания.Вставить("Вагон", ПараметрыПеретаскивания.Значение.Вагон);
	ЗначенияПеретаскивания.Вставить("КодГруза", ПараметрыПеретаскивания.Значение.КодГруза);
	
	ДанныеОЗакреплении = СписокЗаказовПеретаскиваниеНаСервере(ЗначенияПеретаскивания, Строка);
	ДанныеСтрокиДанныеФормы = Элементы.СписокЗаказов.ДанныеСтроки(Строка);
	
	Элементы.СписокЗаказов.Обновить();
	
	ПозицияСлеша = СтрНайти(ДанныеСтрокиДанныеФормы.Количество, "/");
	Количество = Число(Сред(ДанныеСтрокиДанныеФормы.Количество, ПозицияСлеша + 1, СтрДлина(ДанныеСтрокиДанныеФормы.Количество) - ПозицияСлеша))  - 
				 Число(Сред(ДанныеСтрокиДанныеФормы.Количество, 0, ПозицияСлеша - 1));
	ПолноеКоличество = Число(Сред(ДанныеСтрокиДанныеФормы.Количество, ПозицияСлеша + 1, СтрДлина(ДанныеСтрокиДанныеФормы.Количество) - ПозицияСлеша));
	ПозицияСлеша = СтрНайти(ДанныеСтрокиДанныеФормы.Вес, "/");
	Вес = Число(Сред(ДанныеСтрокиДанныеФормы.Вес, ПозицияСлеша + 1, СтрДлина(ДанныеСтрокиДанныеФормы.Вес) - ПозицияСлеша)) - 
		  Число(Сред(ДанныеСтрокиДанныеФормы.Вес, 0, ПозицияСлеша - 1));
	ПолныйВес = Число(Сред(ДанныеСтрокиДанныеФормы.Вес, ПозицияСлеша + 1, СтрДлина(ДанныеСтрокиДанныеФормы.Вес) - ПозицияСлеша));
	ПозицияСлеша = СтрНайти(ДанныеСтрокиДанныеФормы.Объем, "/");
	Объем = Число(Сред(ДанныеСтрокиДанныеФормы.Объем, ПозицияСлеша + 1, СтрДлина(ДанныеСтрокиДанныеФормы.Объем) - ПозицияСлеша)) - 
			Число(Сред(ДанныеСтрокиДанныеФормы.Объем, 0, ПозицияСлеша - 1));
	ПолныйОбъем = Число(Сред(ДанныеСтрокиДанныеФормы.Объем, ПозицияСлеша + 1, СтрДлина(ДанныеСтрокиДанныеФормы.Объем) - ПозицияСлеша));
	
	Вес              = ?(Вес < 0, 0, Вес);
	Объем            = ?(Объем < 0, 0, Объем);
	Количество       = ?(Количество < 0, 0, Количество);
	ПолныйВес        = ?(ПолныйВес < 0, 0, ПолныйВес);
	ПолныйОбъем      = ?(ПолныйОбъем < 0, 0, ПолныйОбъем);
	ПолноеКоличество = ?(ПолноеКоличество < 0, 0, ПолноеКоличество);
	
	ВГХСтруктура = Новый Структура;
	ВГХСтруктура.Вставить("Вес", Вес);
	ВГХСтруктура.Вставить("Объем", Объем);
	ВГХСтруктура.Вставить("Количество", Количество);
	ВГХСтруктура.Вставить("ПолныйВес", ПолныйВес);
	ВГХСтруктура.Вставить("ПолныйОбъем", ПолныйОбъем);
	ВГХСтруктура.Вставить("ПолноеКоличество", ПолноеКоличество);
	ВГХСтруктура.Вставить("СвободныйВес", ПараметрыПеретаскивания.Значение.МаксВес - ПараметрыПеретаскивания.Значение.РаспределеноВес);
	ВГХСтруктура.Вставить("СвободныйОбъем", ПараметрыПеретаскивания.Значение.МаксОбъем - ПараметрыПеретаскивания.Значение.РаспределеноОбъем);
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("ЗаказНаТС", ДанныеСтрокиДанныеФормы.ЗаказНаТС);
	ДанныеСтроки.Вставить("НомерГУ12", ДанныеСтрокиДанныеФормы.НомерГУ12);
	ДанныеСтроки.Вставить("ГрузовоеМесто", ДанныеСтрокиДанныеФормы.ГрузовоеМесто);
	ДанныеСтроки.Вставить("КодГруза", ДанныеСтрокиДанныеФормы.КодГруза);
	ДанныеСтроки.Вставить("Количество", Количество);
	ДанныеСтроки.Вставить("Вес", Вес);
	ДанныеСтроки.Вставить("Объем", Объем);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ЗначенияПеретаскивания", ЗначенияПеретаскивания);
	ДопПараметры.Вставить("Строка", Строка);
	ДопПараметры.Вставить("ДанныеСтроки", ДанныеСтроки);
	ДопПараметры.Вставить("ПараметрыПеретаскивания", ПараметрыПеретаскивания);
	ДопПараметры.Вставить("ДанныеОЗакреплении", ДанныеОЗакреплении);
	ДопПараметры.Вставить("ВГХ", ВГХСтруктура);
	ДопПараметры.Вставить("ДанныеСтроки", ДанныеСтроки);
	
	Если ДанныеОЗакреплении.СоздатьНовуюСтроку = Неопределено Тогда
		
		ТекстНСтр = НСтр("ru = 'Запись с такими ключевыми полями уже существует."
		"Перезаписать данные в существующей строке?'; en = 'A record with these key fields already exists."
		"Overwrite the data in the existing row?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаОтветаОПерезаписиСтроки", ЭтотОбъект, ДопПараметры), ТекстНСтр, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
		
	КонецЕсли;
	
	Если ДанныеОЗакреплении.СоздатьНовуюСтроку Тогда
		
		Если ОбработататьПерегруз(ДопПараметры) = 1 Тогда
			Возврат;
		КонецЕсли;
		
		ДопПараметры.Удалить("ПараметрыПеретаскивания");
		
		СоздатьСтрокуНабораЗаписейОбеспечения(ДопПараметры);
		ПараметрыПеретаскивания.Значение.ЗаказНаТС = Строка.ЗаказНаТС;
		Элементы.СписокЗаказов.Обновить();
		Если Строка = Элементы.СписокЗаказов.ТекущаяСтрока Тогда
			СписокЗаказовПриАктивизацииСтроки(Неопределено);
		КонецЕсли;
		Возврат;
	ИначеЕсли Не ДанныеОЗакреплении.СоздатьНовуюСтроку Тогда
		
		Если ДанныеОЗакреплении.ЗакрепленныйЗаказНаТС = Строка.ЗаказНаТС Тогда
			ТекстНСтр = НСтр("ru = 'Вагон %1 распределен на %3, грузовое место %2."
			"Переназначить на грузовое место %4?'; en = 'Carriage %1 is assigned to %3, cargo space %2."
			"Reassign to cargo space %4?'");
			ТекстНСтр = СтрШаблон(ТекстНСтр, ПараметрыПеретаскивания.Значение.Вагон, ДанныеОЗакреплении.ЗакрепленныйГруз,
				ДанныеОЗакреплении.ЗакрепленныйЗаказНаТС, Строка.ГрузовоеМесто);
		Иначе
			ТекстНСтр = НСтр("ru = 'Вагон %1 распределен на %2, текущий статус: %3. "
			"Открепить от %4 и закрепить за %5?'; en = 'Car %1 is assigned to %2, current status: %3."
			"Detach from %4 and assign to %5?'");
			ЗаказЗакрепленныйСтр = Лев(Строка(Строка.ЗаказНаТС), СтрНайти(Строка(Строка.ЗаказНаТС), "от")-2);
			ЗаказНовыйСтр = Лев(Строка(ДанныеОЗакреплении.ЗакрепленныйЗаказНаТС), СтрНайти(Строка(Строка.ЗаказНаТС), "от")-2);
			ТекстНСтр = СтрШаблон(ТекстНСтр, ПараметрыПеретаскивания.Значение.Вагон, ДанныеОЗакреплении.ЗакрепленныйЗаказНаТС,
				ДанныеОЗакреплении.СтатусЗакрепленногоЗаказа, ЗаказЗакрепленныйСтр, ЗаказНовыйСтр);
		КонецЕсли;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СписокЗаказовПеретаскиваниеЗавершение", ЭтотОбъект, ДопПараметры), ТекстНСтр, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	
	СоздатьСтрокуНабораЗаписейОбеспечения(ДопПараметры);
	ПараметрыПеретаскивания.Значение.ЗаказНаТС = Строка.ЗаказНаТС;
	Элементы.СписокЗаказов.Обновить();
	
	Если Строка = Элементы.СписокЗаказов.ТекущаяСтрока Тогда
		СписокЗаказовПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовПеретаскиваниеПродолжить(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.ДанныеСтроки.Вставить("Количество", Результат.Количество);
	ДопПараметры.ДанныеСтроки.Вставить("Вес", Результат.Вес);
	ДопПараметры.ДанныеСтроки.Вставить("Объем", Результат.Объем);
	ДанныеОЗакреплении = ДопПараметры.ДанныеОЗакреплении;
	Строка = ДопПараметры.Строка;
	ПараметрыПеретаскивания = ДопПараметры.ПараметрыПеретаскивания;
	
	ДопПараметры.Удалить("ПараметрыПеретаскивания");
	Если ДопПараметры.Свойство("Перераспределение") И ДопПараметры.Перераспределение Тогда
		уатЗащищенныеФункцииСервер_уэ.ИзменитьСтрокуНабораЗаписейОбеспечения(ДопПараметры);
		ОбновитьИнформациюВСпискеВагоновПоДислокации();
	Иначе
		СоздатьСтрокуНабораЗаписейОбеспечения(ДопПараметры);
	КонецЕсли;
	ПараметрыПеретаскивания.Значение.ЗаказНаТС = Строка.ЗаказНаТС;
	Элементы.СписокЗаказов.Обновить();
	Если Строка = Элементы.СписокЗаказов.ТекущаяСтрока Тогда
		СписокЗаказовПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаОПерезаписиСтроки(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Или Результат = КодВозвратаДиалога.Нет 
		Или Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДляЗаписиВРегистрОбеспечения = Новый Структура;
	ПараметрыДляЗаписиВРегистрОбеспечения.Вставить("ЗначенияПеретаскивания", ДопПараметры.ЗначенияПеретаскивания);
	ПараметрыДляЗаписиВРегистрОбеспечения.Вставить("Строка", ДопПараметры.Строка);
	ПараметрыДляЗаписиВРегистрОбеспечения.Вставить("ДанныеСтроки", ДопПараметры.ДанныеСтроки);
	ПараметрыДляЗаписиВРегистрОбеспечения.Вставить("ВГХ", ДопПараметры.ВГХ);
	
	ДопПараметры.Вставить("Перераспределение", Истина);
	ДопПараметры.Вставить("Перезаполнение", Истина);
	Если ОбработататьПерегруз(ДопПараметры) = 1 Тогда
		Возврат;
	КонецЕсли;
	уатЗащищенныеФункцииСервер_уэ.ИзменитьСтрокуНабораЗаписейОбеспечения(ПараметрыДляЗаписиВРегистрОбеспечения);
	ОбновитьИнформациюВСпискеВагоновПоДислокации();
	ДопПараметры.ПараметрыПеретаскивания.Значение.ЗаказНаТС = ДопПараметры.Строка.ЗаказНаТС;
	
	Элементы.СписокЗаказов.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ВагоныПоДислокации

&НаКлиенте
Процедура ВагоныПоДислокацииПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборыНаСписокЗаказов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_РаспределенныеВагоны

&НаКлиенте
Процедура РаспределенныеВагоныПриАктивизацииСтроки(Элемент)
	Если Элементы.СписокЗаказов.ТекущиеДанные <> Неопределено 
		И Элементы.РаспределенныеВагоны.ТекущиеДанные <> Неопределено Тогда
		Элементы.РаспределенныеВагоныОткрепить.Видимость = Истина;
	Иначе
		Элементы.РаспределенныеВагоныОткрепить.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоВыбраннойДислокации(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьВагоныПоДокументу", ЭтотОбъект);
	ТекстВопроса = НСтр("en='Clear the tabular section before filling?';ru='Очистить табличную часть перед заполнением?'");
	ТекстЗаголовка = НСтр("en='Clear the table';ru='Очистка таблицы'");
	Если ВагоныПоДислокации.Количество() > 0 Тогда
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, ТекстЗаголовка);
	Иначе
		ЗаполнитьВагоныПоДокументу();
	КонецЕсли;
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПоследнейДислокации(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьВагоныНаДату", ЭтотОбъект);
	ТекстВопроса = НСтр("en='Clear the tabular section before filling?';ru='Очистить табличную часть перед заполнением?'");
	ТекстЗаголовка = НСтр("en='Clear the table';ru='Очистка таблицы'");
	Если ВагоныПоДислокации.Количество() > 0 Тогда
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, ТекстЗаголовка);
	Иначе
		ЗаполнитьВагоныНаДату();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	ПоказатьПредупреждение(,"Функционал в стадии разработки. Алгоритм будет автоматически подбирать Заказы на ТС на все свободные вагоны с учетом рода вагона и кода груза.");
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериода(Команда)
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериода.Период.ДатаНачала = ПериодДатаНач;
	ДиалогПериода.Период.ДатаОкончания = ПериодДатаКон;
	ДиалогПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ПериодДатаНач = Результат.ДатаНачала;
		ПериодДатаКон = Результат.ДатаОкончания;
		
		СписокЗаказов.Параметры.УстановитьЗначениеПараметра("РабочаяДатаНачало", ПериодДатаНач);
		СписокЗаказов.Параметры.УстановитьЗначениеПараметра("РабочаяДатаКонец", ПериодДатаКон);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Открепить(Команда)
	
	ЗакрепленныйЗаказ = Элементы.СписокЗаказов.ТекущиеДанные.ЗаказНаТС;
	ЗакрепленныйТипВагона = Элементы.СписокЗаказов.ТекущиеДанные.ТипВагона;
	ЗакрепленноеГрузовоеМесто = Элементы.СписокЗаказов.ТекущиеДанные.ГрузовоеМесто;
	ЗакрепленныйКодГруза = Элементы.СписокЗаказов.ТекущиеДанные.КодГруза;
	РаспределенныйВагон = Элементы.РаспределенныеВагоны.ТекущиеДанные.Вагон;
	уатЗащищенныеФункцииСервер_уэ.ОткрепитьНаСервере(ЗакрепленныйЗаказ, ЗакрепленноеГрузовоеМесто, РаспределенныйВагон);
	Элементы.СписокЗаказов.Обновить();
	ЗаполнитьТаблицуРаспределенныхВагонов(ЗакрепленныйЗаказ, ЗакрепленныйТипВагона, ЗакрепленноеГрузовоеМесто, ЗакрепленныйКодГруза);
	
	ОбновитьИнформациюВСпискеВагоновПоДислокации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВагоныПоДислокации(Команда)
	ОбновитьИнформациюВСпискеВагоновПоДислокации();
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтборПоРодуВагона(Команда)
	
	Элементы.СписокЗаказовВключитьОтборПоРодуВагона.Пометка = Не Элементы.СписокЗаказовВключитьОтборПоРодуВагона.Пометка;
	УстановитьОтборыНаСписокЗаказов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтборПоКодуГруза(Команда)
	
	Элементы.СписокЗаказовВключитьОтборПоКодуГруза.Пометка = Не Элементы.СписокЗаказовВключитьОтборПоКодуГруза.Пометка;
	УстановитьОтборыНаСписокЗаказов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗаказов(Команда)
	Элементы.СписокЗаказов.Обновить();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьВагоныПоДокументу(Результат = Неопределено, ДопПараметры = Неопределено) Экспорт
	ДополнительныеПараметры = Новый Структура();
	Очистить = ?(Результат = КодВозвратаДиалога.Да, Истина, Ложь);
	ДополнительныеПараметры.Вставить("Очистить", Очистить);
	ОповещениеОВыборе = Новый ОписаниеОповещения("ЗавершениеВыбораДокументаДляЗаполнения", ЭтотОбъект, ДополнительныеПараметры);
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("Организация", Организация);
	ПараметрыОткрытия.Вставить("Подразделение", Подразделение);
	
	ОткрытьФорму("Документ.уатДислокацияВагонов.ФормаВыбора",ПараметрыОткрытия,,,,,
	ОповещениеОВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораДокументаДляЗаполнения(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьСписокТСПоДокументу(Результат, ДопПараметры);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокТСПоДокументу(Документ, ДопПараметры)
	Если ДопПараметры.Очистить Тогда
		ВагоныПоДислокации.Очистить();
	КонецЕсли;
	Для каждого ТекВагон Из Документ.Вагоны Цикл
		Если ЗначениеЗаполнено(Станция) И ТекВагон.СтанцияНазначения <> Станция Тогда
			Продолжить;
		КонецЕсли;
			
		НоваяСтрока = ВагоныПоДислокации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекВагон);
		НоваяСтрока.НаименованиеКодаГруза = ?(ЗначениеЗаполнено(НоваяСтрока.КодГруза),НоваяСтрока.КодГруза.Наименование, "");
		
		КоэффициентВес = 1;
		КоэффициентОбъем = 1;
		
		Если Константы.уатЕдиницаИзмеренияВеса.Получить() = Перечисления.уатЕдиницыИзмеренияВеса.Килограмм Тогда
			КоэффициентВес = 1000;
		КонецЕсли;
		
		Если Константы.уатЕдиницаИзмеренияОбъема.Получить() = Перечисления.уатЕдиницыИзмеренияОбъема.Литр Тогда
			КоэффициентОбъем = 1000;
		КонецЕсли;
		
		НоваяСтрока.МаксВес = ТекВагон.Вагон.Модель.Грузоподъемность * КоэффициентВес;
		НоваяСтрока.МаксОбъем = ТекВагон.Вагон.Модель.ОбъемКузова * КоэффициентОбъем;
		
	КонецЦикла;
	
	ОбновитьИнформациюВСпискеВагоновПоДислокации();
	
	Если ВагоныПоДислокации.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='В выбранной Дислокации %1 не заполнен список вагонов'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", Документ);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВагоныНаДату(Результат = Неопределено, ДопПараметры = Неопределено) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВагоныПоДислокации.Очистить();
	КонецЕсли;
	ЗаполнитьНаДатуНаСервере()
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаДатуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	уатДислокацияВагонов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втДислокация
	|ИЗ
	|	Документ.уатДислокацияВагонов КАК уатДислокацияВагонов
	|ГДЕ
	|	НЕ уатДислокацияВагонов.ПометкаУдаления
	|	И уатДислокацияВагонов.Проведен
	|	И уатДислокацияВагонов.Дата <= &Дата";
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.Текст = Запрос.Текст + "	И уатДислокацияВагонов.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Запрос.Текст = Запрос.Текст + "	И уатДислокацияВагонов.Подразделение = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	КонецЕсли;
	
	// SHMI: некорректное условие, в шапке нет станции
	//Если ЗначениеЗаполнено(Станция) Тогда
	//	Запрос.Текст = Запрос.Текст + "	И уатДислокацияВагонов.СтанцияНазначения = &Станция";
	//	Запрос.УстановитьПараметр("Станция", Станция);
	//КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	уатДислокацияВагонов.Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДислокация.Ссылка Как Ссылка,
	|	уатДислокацияВагоновВагоны.НомерСтроки КАК НомерСтроки,
	|	уатДислокацияВагоновВагоны.Вагон КАК Вагон,
	|	уатДислокацияВагоновВагоны.РодВагона КАК РодВагона,
	|	уатДислокацияВагоновВагоны.НакладнаяГУ27 КАК НакладнаяГУ27,
	|	уатДислокацияВагоновВагоны.НачалоРейса КАК НачалоРейса,
	|	уатДислокацияВагоновВагоны.СтанцияОтправления КАК СтанцияОтправления,
	|	уатДислокацияВагоновВагоны.ОкончаниеРейса КАК ОкончаниеРейса,
	|	уатДислокацияВагоновВагоны.СтанцияНазначения КАК СтанцияНазначения,
	|	уатДислокацияВагоновВагоны.Грузоотправитель КАК Грузоотправитель,
	|	уатДислокацияВагоновВагоны.Грузополучатель КАК Грузополучатель,
	|	уатДислокацияВагоновВагоны.КодГруза КАК КодГруза,
	|	уатДислокацияВагоновВагоны.Груз КАК Груз,
	|	уатДислокацияВагоновВагоны.ВесГруза КАК ВесГруза,
	|	уатДислокацияВагоновВагоны.ОстатокПробега КАК ОстатокПробега,
	|	уатДислокацияВагоновВагоны.СтанцияОперации КАК СтанцияОперации,
	|	уатДислокацияВагоновВагоны.ОперацияСВагоном КАК ОперацияСВагоном,
	|	уатДислокацияВагоновВагоны.ДатаОперации КАК ДатаОперации,
	|	уатДислокацияВагоновВагоны.РасстояниеПройденное КАК РасстояниеПройденное,
	|	уатДислокацияВагоновВагоны.РасстояниеОставшееся КАК РасстояниеОставшееся,
	|	уатДислокацияВагоновВагоны.РасстояниеОбщее КАК РасстояниеОбщее,
	|	уатДислокацияВагоновВагоны.ДатаОтправленияСоСтанцииПриема КАК ДатаОтправленияСоСтанцииПриема,
	|	уатДислокацияВагоновВагоны.ДатаПрибытия КАК ДатаПрибытия
	|ИЗ
	|	втДислокация КАК втДислокация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатДислокацияВагонов.Вагоны КАК уатДислокацияВагоновВагоны
	|		ПО втДислокация.Ссылка = уатДислокацияВагоновВагоны.Ссылка";
	Запрос.УстановитьПараметр("Дата", ПериодДатаКон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = НСтр("ru='Не введенно ни одного документа ""Дислокация вагонов""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	КоэффициентВес = 1;
	КоэффициентОбъем = 1;
	
	Если Константы.уатЕдиницаИзмеренияВеса.Получить() = Перечисления.уатЕдиницыИзмеренияВеса.Килограмм Тогда
		КоэффициентВес = 1000;
	КонецЕсли;
	
	Если Константы.уатЕдиницаИзмеренияОбъема.Получить() = Перечисления.уатЕдиницыИзмеренияОбъема.Литр Тогда
		КоэффициентОбъем = 1000;
	КонецЕсли;
	
	Выгрузка = РезультатЗапроса.Выгрузить();
	Для каждого ТекСтрока Из Выгрузка Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.Вагон) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ВагоныПоДислокации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.НаименованиеКодаГруза = ?(ЗначениеЗаполнено(НоваяСтрока.КодГруза),НоваяСтрока.КодГруза.Наименование, "");
		
		НоваяСтрока.МаксВес = ТекСтрока.Вагон.Модель.Грузоподъемность * КоэффициентВес;
		НоваяСтрока.МаксОбъем = ТекСтрока.Вагон.Модель.ОбъемКузова * КоэффициентОбъем;
		
	КонецЦикла;
	
	ОбновитьИнформациюВСпискеВагоновПоДислокации();
	
	Если Выгрузка.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Не введенно ни одного документа ""Дислокация вагонов""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ВагоныПоДислокации.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='В последнем документе %1 не заполнен список вагонов'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", Выгрузка[0].Ссылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокЗаказовПеретаскиваниеНаСервере(ЗначениеПеретаскивания, Строка)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СоздатьНовуюСтроку");
	СтруктураВозврата.Вставить("ЗакрепленныйЗаказНаТС");
	СтруктураВозврата.Вставить("ЗакрепленныйКодГруза");
	СтруктураВозврата.Вставить("ЗакрепленныйГруз");
	СтруктураВозврата.Вставить("СтатусЗакрепленногоЗаказа");
	
	НаборЗаписей = РегистрыСведений.уатОбеспечениеЗаказовНаТСВагонами.СоздатьНаборЗаписей();
	НаборЗаписей.Заполнить(Неопределено);
	НаборЗаписей.Отбор.ЗаказНаТС.Установить(Строка.ЗаказНаТС);
	НаборЗаписей.Отбор.Вагон.Установить(ЗначениеПеретаскивания.Вагон);
	НаборЗаписей.Отбор.Груз.Установить(Строка.ГрузовоеМесто);
	НаборЗаписей.Отбор.КодГруза.Установить(Строка.КодГруза);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		
		СтруктураВозврата.СоздатьНовуюСтроку = Неопределено;
		СтруктураВозврата.ЗакрепленныйЗаказНаТС = Неопределено;
		СтруктураВозврата.ЗакрепленныйКодГруза = Неопределено;
		СтруктураВозврата.СтатусЗакрепленногоЗаказа = Неопределено;
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС КАК ЗаказНаТС,
	|	уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.Дата КАК ЗаказДата,
	|	уатОбеспечениеЗаказовНаТСВагонами.КодГруза КАК КодГруза
	|ИЗ
	|	РегистрСведений.уатОбеспечениеЗаказовНаТСВагонами КАК уатОбеспечениеЗаказовНаТСВагонами
	|ГДЕ
	|	уатОбеспечениеЗаказовНаТСВагонами.Вагон = &Вагон
	|
	|УПОРЯДОЧИТЬ ПО
	|	уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.Дата";
	Запрос.УстановитьПараметр("Вагон", ЗначениеПеретаскивания.Вагон);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Если Выгрузка.Количество() = 0 Тогда
		
		СтруктураВозврата.СоздатьНовуюСтроку = Истина;
		СтруктураВозврата.ЗакрепленныйЗаказНаТС = Неопределено;
		СтруктураВозврата.ЗакрепленныйКодГруза = Неопределено;
		СтруктураВозврата.СтатусЗакрепленногоЗаказа = Неопределено;
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Выгрузка.Сортировать("ЗаказДата");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Выгрузка[Выгрузка.Количество() - 1].ЗаказНаТС);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЗаказГрузоотправителя.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВРТ_Документы
	|ИЗ
	|	Документ.уатЗаказГрузоотправителя КАК уатЗаказГрузоотправителя
	|ГДЕ
	|	уатЗаказГрузоотправителя.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уатЭтапыМультимодальныхПеревозок_уэ.Этап
	|ИЗ
	|	РегистрСведений.уатЭтапыМультимодальныхПеревозок_уэ КАК уатЭтапыМультимодальныхПеревозок_уэ
	|ГДЕ
	|	уатЭтапыМультимодальныхПеревозок_уэ.ЗаказГрузоотправителя = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатСтатусыГрузов_уэСрезПоследних.Период КАК Период,
	|	уатСтатусыГрузов_уэСрезПоследних.ГрузовоеМесто КАК ГрузовоеМесто,
	|	уатСтатусыГрузов_уэСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.уатСтатусыГрузов_уэ.СрезПоследних(
	|			,
	|			Заказ В
	|				(ВЫБРАТЬ
	|					ВТ.Заказ
	|				ИЗ
	|					ВРТ_Документы КАК ВТ)) КАК уатСтатусыГрузов_уэСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГрузовоеМесто,
	|	Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатЗаказГрузоотправителя.Ссылка КАК Ссылка,
	|	уатЗаказГрузоотправителя.Мультимодальный КАК Мультимодальный,
	|	уатЗаказГрузоотправителя.ЭтоЭтап КАК ЭтоЭтап
	|ПОМЕСТИТЬ ВТ_ТекущийЗаказ
	|ИЗ
	|	Документ.уатЗаказГрузоотправителя КАК уатЗаказГрузоотправителя
	|ГДЕ
	|	уатЗаказГрузоотправителя.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатЭтапыМультимодальныхПеревозок_уэ.Этап КАК Этап
	|ПОМЕСТИТЬ ВТ_ЭтапыМультимодальныхПеревозок
	|ИЗ
	|	РегистрСведений.уатЭтапыМультимодальныхПеревозок_уэ КАК уатЭтапыМультимодальныхПеревозок_уэ
	|ГДЕ
	|	уатЭтапыМультимодальныхПеревозок_уэ.ЗаказГрузоотправителя = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА уатЗаказГрузоотправителя.Мультимодальный
	|				И НЕ уатЗаказГрузоотправителя.ЭтоЭтап
	|			ТОГДА ЕСТЬNULL(СтатусРодительскогоЗаказа.СтатусЭтапа, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый))
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый))) > 1
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Составной)
	|				ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый)))
	|			КОНЕЦ
	|	КОНЕЦ КАК СтатусЗаказа
	|ИЗ
	|	ВТ_ТекущийЗаказ КАК уатЗаказГрузоотправителя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСтатусыГрузов_уэ.СрезПоследних(, Заказ = &Ссылка) КАК уатСтатусыГрузов_уэСрезПоследних
	|		ПО (уатСтатусыГрузов_уэСрезПоследних.Заказ = уатЗаказГрузоотправителя.Ссылка),
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый))) > 1
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Составной)
	|			ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый)))
	|		КОНЕЦ КАК СтатусЭтапа
	|	ИЗ
	|		ВТ_ЭтапыМультимодальныхПеревозок КАК уатЭтапыМультимодальныхПеревозок_уэ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСтатусыГрузов_уэ.СрезПоследних(
	|					,
	|					Заказ В
	|						(ВЫБРАТЬ
	|							ВТ_ЭтапыМультимодальныхПеревозок.Этап
	|						ИЗ
	|							ВТ_ЭтапыМультимодальныхПеревозок)) КАК уатСтатусыГрузов_уэСрезПоследних
	|			ПО уатЭтапыМультимодальныхПеревозок_уэ.Этап = уатСтатусыГрузов_уэСрезПоследних.Заказ) КАК СтатусРодительскогоЗаказа
	|
	|СГРУППИРОВАТЬ ПО
	|	уатЗаказГрузоотправителя.Мультимодальный,
	|	уатЗаказГрузоотправителя.ЭтоЭтап,
	|	СтатусРодительскогоЗаказа.СтатусЭтапа";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыгрузкаДокумент = РезультатЗапроса[4].Выгрузить();
	Если ВыгрузкаДокумент.Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВыгрузкаДокумент[0].СтатусЗаказа = Справочники.уатСтатусы_уэ.Закрыт Или
		ВыгрузкаДокумент[0].СтатусЗаказа = Справочники.уатСтатусы_уэ.ОтменаРейса Тогда
		
		СтруктураВозврата.СоздатьНовуюСтроку = Истина;
		СтруктураВозврата.ЗакрепленныйЗаказНаТС = Неопределено;
		СтруктураВозврата.ЗакрепленныйКодГруза = Неопределено;
		СтруктураВозврата.СтатусЗакрепленногоЗаказа = Неопределено;
		Возврат СтруктураВозврата;
		
	Иначе
		
		СтруктураВозврата.СоздатьНовуюСтроку = Ложь;
		СтруктураВозврата.ЗакрепленныйЗаказНаТС = Выгрузка[Выгрузка.Количество() - 1].ЗаказНаТС;
		СтруктураВозврата.ЗакрепленныйКодГруза = Выгрузка[Выгрузка.Количество() - 1].КодГруза;
		СтруктураВозврата.СтатусЗакрепленногоЗаказа = ВыгрузкаДокумент[0].СтатусЗаказа;
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборыНаСписокЗаказов()
	
	ТекущиеДанные = Элементы.ВагоныПоДислокации.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не (Элементы.СписокЗаказовВключитьОтборПоРодуВагона.Пометка И Элементы.СписокЗаказовВключитьОтборПоКодуГруза.Пометка) Тогда
		СписокЗаказов.Отбор.Элементы.Очистить();
	КонецЕсли;
	
	Если Элементы.СписокЗаказовВключитьОтборПоРодуВагона.Пометка Тогда
		
		ТекущийРодВагона = ТекущиеДанные.РодВагона;
		Если ЗначениеЗаполнено(ТекущийРодВагона) Тогда
			ЭлементОтбора = СписокЗаказов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РодВагона");
			ЭлементОтбора.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение  = ТекущийРодВагона;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Элементы.СписокЗаказовВключитьОтборПоКодуГруза.Пометка Тогда
		
		ТекущийКодГруза  = ТекущиеДанные.КодГруза;
		Если ЗначениеЗаполнено(ТекущийКодГруза) Тогда
			ЭлементОтбора = СписокЗаказов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КодГруза");
			ЭлементОтбора.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение  = ТекущийКодГруза;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовПеретаскиваниеЗавершение(Результат, ДопПараметры = Неопределено) Экспорт
	
	ПараметрыДляЗаписиВРегистрОбеспечения = Новый Структура;
	ПараметрыДляЗаписиВРегистрОбеспечения.Вставить("ЗначенияПеретаскивания", ДопПараметры.ЗначенияПеретаскивания);
	ПараметрыДляЗаписиВРегистрОбеспечения.Вставить("Строка", ДопПараметры.Строка);
	ПараметрыДляЗаписиВРегистрОбеспечения.Вставить("ДанныеСтроки", ДопПараметры.ДанныеСтроки);
	ПараметрыДляЗаписиВРегистрОбеспечения.Вставить("ВГХ", ДопПараметры.ВГХ);
	
	Если Результат = КодВозвратаДиалога.Отмена Или Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Если ОбработататьПерегруз(ДопПараметры) = 1 Тогда
			Возврат;
		КонецЕсли;
		СоздатьСтрокуНабораЗаписейОбеспечения(ПараметрыДляЗаписиВРегистрОбеспечения);
	Иначе
		ДопПараметры.Вставить("Перераспределение", Истина);
		Если ОбработататьПерегруз(ДопПараметры) = 1 Тогда
			Возврат;
		КонецЕсли;
		уатЗащищенныеФункцииСервер_уэ.ИзменитьСтрокуНабораЗаписейОбеспечения(ПараметрыДляЗаписиВРегистрОбеспечения);
		ОбновитьИнформациюВСпискеВагоновПоДислокации();
	КонецЕсли;
	
	ДопПараметры.ПараметрыПеретаскивания.Значение.ЗаказНаТС = ДопПараметры.Строка.ЗаказНаТС;
	
	Элементы.СписокЗаказов.Обновить();
	
	Если ДопПараметры.Строка = Элементы.СписокЗаказов.ТекущаяСтрока Тогда
		СписокЗаказовПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСтрокуНабораЗаписейОбеспечения(ДанныеДляРегистра)
	
	ДанныеСтроки = ДанныеДляРегистра.ДанныеСтроки;
	ЗначениеПеретаскивания = ДанныеДляРегистра.ЗначенияПеретаскивания;
	ВГХ = ДанныеДляРегистра.ВГХ;
	
	НаборЗаписей = РегистрыСведений.уатОбеспечениеЗаказовНаТСВагонами.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Вагон.Установить(ЗначениеПеретаскивания.Вагон);
	НаборЗаписей.Прочитать();
	
	СтрокаНабораЗаписей = НаборЗаписей.Добавить();
	СтрокаНабораЗаписей.ЗаказНаТС = ДанныеСтроки.ЗаказНаТС;
	СтрокаНабораЗаписей.НомерГУ12 = ДанныеСтроки.НомерГУ12;
	СтрокаНабораЗаписей.Груз = ДанныеСтроки.ГрузовоеМесто;
	СтрокаНабораЗаписей.КодГруза = ДанныеСтроки.КодГруза;
	СтрокаНабораЗаписей.Вагон = ЗначениеПеретаскивания.Вагон;
	СтрокаНабораЗаписей.Количество = ДанныеСтроки.Количество;
	СтрокаНабораЗаписей.Вес = ДанныеСтроки.Вес;
	СтрокаНабораЗаписей.Объем = ДанныеСтроки.Объем;
	НаборЗаписей.Записать();
	
	ОбновитьИнформациюВСпискеВагоновПоДислокации();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРаспределенныхВагонов(ЗаказНаТС, ТипВагона, ГрузовоеМесто, КодГруза)
	
	РаспределенныеВагоны.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатОбеспечениеЗаказовНаТСВагонами.Вагон КАК Вагон
	|ПОМЕСТИТЬ ВТ_Вагоны
	|ИЗ
	|	РегистрСведений.уатОбеспечениеЗаказовНаТСВагонами КАК уатОбеспечениеЗаказовНаТСВагонами
	|ГДЕ
	|	уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС = &ЗаказНаТС
	|	И уатОбеспечениеЗаказовНаТСВагонами.Груз = &ГрузовоеМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Вагоны.Вагон КАК Вагон,
	|	уатДислокацияВагоновВагоны.Ссылка КАК Дислокация
	|ИЗ
	|	ВТ_Вагоны КАК ВТ_Вагоны
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатДислокацияВагонов.Вагоны КАК уатДислокацияВагоновВагоны
	|		ПО ВТ_Вагоны.Вагон = уатДислокацияВагоновВагоны.Вагон
	|
	|УПОРЯДОЧИТЬ ПО
	|	уатДислокацияВагоновВагоны.Ссылка.МоментВремени УБЫВ
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Дислокация)
	|ПО
	|	Вагон";
	Запрос.УстановитьПараметр("ЗаказНаТС", ЗаказНаТС);
	Запрос.УстановитьПараметр("ГрузовоеМесто", ГрузовоеМесто);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = РаспределенныеВагоны.Добавить();
		НоваяСтрока.Вагон = Выборка.Вагон;
		НоваяСтрока.ОтборПоТипуВагона = Выборка.Вагон.ТипТС = ТипВагона;
		ВыборкаВнутренняя = Выборка.Выбрать();
		Если ВыборкаВнутренняя.Следующий() Тогда
			НоваяСтрока.Дислокация = ВыборкаВнутренняя.Дислокация;
		Иначе
			НоваяСтрока.Дислокация = Документы.уатДислокацияВагонов.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюВСпискеВагоновПоДислокации()
	
	Для каждого ТекВагонПоДислокации Из ВагоныПоДислокации Цикл
		НаборЗаписей = РегистрыСведений.уатОбеспечениеЗаказовНаТСВагонами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Вагон.Установить(ТекВагонПоДислокации.Вагон);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			СтрокаОбеспечения = ПолучитьПоследнююСтрокуОбеспечения(НаборЗаписей);
			ТекВагонПоДислокации.ЗаказНаТС = СтрокаОбеспечения.ЗаказНаТС;
			ТекВагонПоДислокации.НомерГУ12 = СтрокаОбеспечения.НомерГУ12;
			НаборЗаписей.Отбор.ЗаказНаТС.Установить(ТекВагонПоДислокации.ЗаказНаТС);
			НаборЗаписей.Прочитать();
			ТекВагонПоДислокации.РаспределеноВес = НаборЗаписей.Итог("Вес");
			ТекВагонПоДислокации.РаспределеноОбъем = НаборЗаписей.Итог("Объем");
			
			ТекВагонПоДислокации.РаспределеноВесПредставление = Строка(ТекВагонПоДислокации.РаспределеноВес) + "/" + ТекВагонПоДислокации.МаксВес;
			ТекВагонПоДислокации.РаспределеноОбъемПредставление = Строка(ТекВагонПоДислокации.РаспределеноОбъем) + "/" + ТекВагонПоДислокации.МаксОбъем;
		Иначе
			ТекВагонПоДислокации.ЗаказНаТС = Неопределено;
			ТекВагонПоДислокации.НомерГУ12 = "";
			
			ТекВагонПоДислокации.РаспределеноВес = 0;
			ТекВагонПоДислокации.РаспределеноОбъем = 0;
			
			ТекВагонПоДислокации.РаспределеноВесПредставление = Строка(ТекВагонПоДислокации.РаспределеноВес) + "/" + ТекВагонПоДислокации.МаксВес;
			ТекВагонПоДислокации.РаспределеноОбъемПредставление = Строка(ТекВагонПоДислокации.РаспределеноОбъем) + "/" + ТекВагонПоДислокации.МаксОбъем;
		КонецЕсли;
	КонецЦикла;;
	
КонецПроцедуры

&НаКлиенте
Функция ОбработататьПерегруз(ДопПараметры)
	
	ВГХ = ДопПараметры.ВГХ;
	
	Если ДопПараметры.Свойство("Перераспределение") И ДопПараметры.Перераспределение Тогда
		ВГХ.Вставить("СвободныйВес", ДопПараметры.ПараметрыПеретаскивания.Значение.МаксВес);
		ВГХ.Вставить("СвободныйОбъем", ДопПараметры.ПараметрыПеретаскивания.Значение.МаксОбъем);
	КонецЕсли;
	
	Если ДопПараметры.Свойство("Перезаполнение") И ДопПараметры.Перезаполнение Тогда
		ВГХ.Вставить("Вес", ВГХ.ПолныйВес);
		ВГХ.Вставить("Объем", ВГХ.ПолныйОбъем);
		ВГХ.Вставить("Количество", ВГХ.ПолноеКоличество);
		ДопПараметры.ДанныеСтроки.Вставить("Вес", ВГХ.ПолныйВес);
		ДопПараметры.ДанныеСтроки.Вставить("Объем", ВГХ.ПолныйОбъем);
		ДопПараметры.ДанныеСтроки.Вставить("Количество", ВГХ.ПолноеКоличество);
	КонецЕсли;
	
	Количество = ВГХ.Количество;
	Вес = ВГХ.Вес;
	Объем = ВГХ.Объем;
	
	СвободныйВес = ВГХ.СвободныйВес;
	СвободныйОбъем = ВГХ.СвободныйОбъем;
	
	Если Вес > СвободныйВес Или Объем > СвободныйОбъем Тогда
		
		ТекстНСтр = НСтр("ru = 'Вагон %1 не вмещает весь распределяемый груз. Измените параметры груза в данной форме для избежания перегруза'; en = 'The wagon %1 does not accommodate all the distributed cargo. Change the cargo parameters in this form to avoid overloading.'");
		ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", ДопПараметры.ПараметрыПеретаскивания.Значение.Вагон);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		ОписаниеОповещения = Новый ОписаниеОповещения("СписокЗаказовПеретаскиваниеПродолжить", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("Обработка.уатРаспределениеВагоновПоЗаказамНаТС.Форма.ФормаИзмененияВесоОбъемныхХарактеристик",
			ВГХ, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат 1;
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция ПолучитьПоследнююСтрокуОбеспечения(НаборЗаписей)
	
	ТЗОбеспечение = Новый ТаблицаЗначений;
	ТЗОбеспечение.Колонки.Добавить("ЗаказНаТС");
	ТЗОбеспечение.Колонки.Добавить("НомерГУ12");
	ТЗОбеспечение.Колонки.Добавить("ОтправлениеС");
	Для каждого ТекОбеспечение Из НаборЗаписей Цикл
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ТекОбеспечение.ЗаказНаТС);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатЗаказГрузоотправителя.Ссылка КАК Заказ
		|ПОМЕСТИТЬ ВРТ_Документы
		|ИЗ
		|	Документ.уатЗаказГрузоотправителя КАК уатЗаказГрузоотправителя
		|ГДЕ
		|	уатЗаказГрузоотправителя.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уатЭтапыМультимодальныхПеревозок_уэ.Этап
		|ИЗ
		|	РегистрСведений.уатЭтапыМультимодальныхПеревозок_уэ КАК уатЭтапыМультимодальныхПеревозок_уэ
		|ГДЕ
		|	уатЭтапыМультимодальныхПеревозок_уэ.ЗаказГрузоотправителя = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	уатСтатусыГрузов_уэСрезПоследних.Период КАК Период,
		|	уатСтатусыГрузов_уэСрезПоследних.ГрузовоеМесто КАК ГрузовоеМесто,
		|	уатСтатусыГрузов_уэСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.уатСтатусыГрузов_уэ.СрезПоследних(
		|			,
		|			Заказ В
		|				(ВЫБРАТЬ
		|					ВТ.Заказ
		|				ИЗ
		|					ВРТ_Документы КАК ВТ)) КАК уатСтатусыГрузов_уэСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГрузовоеМесто,
		|	Период УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	уатЗаказГрузоотправителя.Ссылка КАК Ссылка,
		|	уатЗаказГрузоотправителя.Мультимодальный КАК Мультимодальный,
		|	уатЗаказГрузоотправителя.ЭтоЭтап КАК ЭтоЭтап
		|ПОМЕСТИТЬ ВТ_ТекущийЗаказ
		|ИЗ
		|	Документ.уатЗаказГрузоотправителя КАК уатЗаказГрузоотправителя
		|ГДЕ
		|	уатЗаказГрузоотправителя.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	уатЭтапыМультимодальныхПеревозок_уэ.Этап КАК Этап
		|ПОМЕСТИТЬ ВТ_ЭтапыМультимодальныхПеревозок
		|ИЗ
		|	РегистрСведений.уатЭтапыМультимодальныхПеревозок_уэ КАК уатЭтапыМультимодальныхПеревозок_уэ
		|ГДЕ
		|	уатЭтапыМультимодальныхПеревозок_уэ.ЗаказГрузоотправителя = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА уатЗаказГрузоотправителя.Мультимодальный
		|				И НЕ уатЗаказГрузоотправителя.ЭтоЭтап
		|			ТОГДА ЕСТЬNULL(СтатусРодительскогоЗаказа.СтатусЭтапа, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый))
		|		ИНАЧЕ ВЫБОР
		|				КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый))) > 1
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Составной)
		|				ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый)))
		|			КОНЕЦ
		|	КОНЕЦ КАК СтатусЗаказа
		|ИЗ
		|	ВТ_ТекущийЗаказ КАК уатЗаказГрузоотправителя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСтатусыГрузов_уэ.СрезПоследних(, Заказ = &Ссылка) КАК уатСтатусыГрузов_уэСрезПоследних
		|		ПО (уатСтатусыГрузов_уэСрезПоследних.Заказ = уатЗаказГрузоотправителя.Ссылка),
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый))) > 1
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Составной)
		|			ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый)))
		|		КОНЕЦ КАК СтатусЭтапа
		|	ИЗ
		|		ВТ_ЭтапыМультимодальныхПеревозок КАК уатЭтапыМультимодальныхПеревозок_уэ
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСтатусыГрузов_уэ.СрезПоследних(
		|					,
		|					Заказ В
		|						(ВЫБРАТЬ
		|							ВТ_ЭтапыМультимодальныхПеревозок.Этап
		|						ИЗ
		|							ВТ_ЭтапыМультимодальныхПеревозок)) КАК уатСтатусыГрузов_уэСрезПоследних
		|			ПО уатЭтапыМультимодальныхПеревозок_уэ.Этап = уатСтатусыГрузов_уэСрезПоследних.Заказ) КАК СтатусРодительскогоЗаказа
		|
		|СГРУППИРОВАТЬ ПО
		|	уатЗаказГрузоотправителя.Мультимодальный,
		|	уатЗаказГрузоотправителя.ЭтоЭтап,
		|	СтатусРодительскогоЗаказа.СтатусЭтапа";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ВыгрузкаДокумент = РезультатЗапроса[4].Выгрузить();
		Если ВыгрузкаДокумент.Количество() = 0 Тогда 
			Возврат Неопределено;
		КонецЕсли;
		
		Если ВыгрузкаДокумент[0].СтатусЗаказа = Справочники.уатСтатусы_уэ.Закрыт Или
			ВыгрузкаДокумент[0].СтатусЗаказа = Справочники.уатСтатусы_уэ.ОтменаРейса Тогда
			
			Продолжить;
			
		Иначе
			
			НоваяСтрока = ТЗОбеспечение.Добавить();
			НоваяСтрока.ЗаказНаТС = ТекОбеспечение.ЗаказНаТС;
			НоваяСтрока.НомерГУ12 = ТекОбеспечение.НомерГУ12;
			НоваяСтрока.ОтправлениеС = ТекОбеспечение.ЗаказНаТС.ОтправлениеС;
			
		КонецЕсли;
	КонецЦикла;
	
	ТЗОбеспечение.Сортировать("ОтправлениеС");
	ПоследняяСтрока = ТЗОбеспечение[ТЗОбеспечение.Количество() - 1];
	
	СтрокаОбеспечения = Новый Структура;
	СтрокаОбеспечения.Вставить("ЗаказНаТС", ПоследняяСтрока.ЗаказНаТС);
	СтрокаОбеспечения.Вставить("НомерГУ12", ПоследняяСтрока.НомерГУ12);
	
	Возврат СтрокаОбеспечения;
	
КонецФункции

#КонецОбласти
